backend-rails/app/controllers/internal/v1/tasks_controller.rb

SELECT `task_labels`.* FROM `task_labels` WHERE `task_labels`.`task_id` = 254
---
        scope = current_user.tasks.includes(:labels)

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 6 AND `tasks`.`id` = 254 LIMIT 1
---
        task = current_user.tasks.find(params[:id])

INSERT INTO `tasks` (`name`, `description`, `status`, `finished_on`, `user_id`, `created_at`, `updated_at`) VALUES ('rails-smoke', NULL, 1, '2030-01-01', 6, '2026-09-08 21:25:16', '2026-09-08 21:25:16')
---
        task = current_user.tasks.new(
          name: body[:name], description: body[:description],
          status: body[:status], finished_on: finished_on
        )

        if task.save

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 6 AND `tasks`.`id` = 254 LIMIT 1
UPDATE `tasks` SET `tasks`.`name` = 'rails-smoke-upd', `tasks`.`status` = 3, `tasks`.`finished_on` = '2030-02-02', `tasks`.`updated_at` = '2026-09-08 21:25:26' WHERE `tasks`.`id` = 254
---
        task = current_user.tasks.find(params[:id])
        body = required_task_body
        return unless body

        finished_on = parse_finished_on(body[:finished_on])
        return unless finished_on

        task.assign_attributes(
          name: body[:name], description: body[:description],
          status: body[:status], finished_on: finished_on
        )
        assign_labels(task, body[:label_ids])

        if task.save

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 6 AND `tasks`.`id` = 254 LIMIT 1
DELETE FROM `tasks` WHERE `tasks`.`id` = 254
---
        task = current_user.tasks.find(params[:id])
        task.destroy!