admin/rails/app/controllers/feature_flags_controller.rb

SELECT `feature_flags`.* FROM `feature_flags` ORDER BY `feature_flags`.`flag_key` ASC
---
  def index
    @feature_flags = FeatureFlag.order(:flag_key)

UPDATE `feature_flags` SET `feature_flags`.`default_variation` = 'on', `feature_flags`.`updated_at` = '2026-09-08 01:28:18' WHERE `feature_flags`.`id` = 3
INSERT INTO `feature_flag_audit_logs` (`feature_flag_id`, `flag_key`, `before_default_variation`, `after_default_variation`, `before_enabled`, `after_enabled`, `changed_by`, `changed_at`) VALUES (3, 'backend.external-tasks-pagination-v2', 'off', 'on', TRUE, TRUE, 'admin', '2026-09-08 01:28:18')
---
  def update
    before_enabled = @feature_flag.enabled
    before_default_variation = @feature_flag.default_variation

    if @feature_flag.update(feature_flag_params)
      FeatureFlagAuditLog.create!(
        feature_flag_id: @feature_flag.id,
        flag_key: @feature_flag.flag_key,
        before_enabled: before_enabled,
        after_enabled: @feature_flag.enabled,
        before_default_variation: before_default_variation,
        after_default_variation: @feature_flag.default_variation,
        changed_by: current_admin_name,
        changed_at: Time.current
      )

SELECT `feature_flag_audit_logs`.* FROM `feature_flag_audit_logs` WHERE `feature_flag_audit_logs`.`feature_flag_id` = 3 ORDER BY `feature_flag_audit_logs`.`changed_at` DESC
---
  def audit_logs
    @feature_flag_audit_logs = @feature_flag.feature_flag_audit_logs.order(changed_at: :desc)

SELECT `feature_flags`.* FROM `feature_flags` WHERE `feature_flags`.`id` = 3 LIMIT 1
---
  def set_feature_flag
    @feature_flag = FeatureFlag.find(params[:id])